#+title: GoHarp, Harp implementation in Go
#+author: Félix Jamet

#+property: header-args :noweb yes :results output
#+property: header-args:go+ :main no

*** Plain token predicate

This predicate determines which runes can go in a plain token.
I choose to make it quite restrictive so that interesting runes like =[]{}#= can be used in a future implementation for other purposes.
At worst it's easy to enlarge the definition by altering the predicate.

#+name: isPlainTokenRune
#+begin_src go
// isPlainTokenRune test for characters that can go anywhere in a plain token.
func isPlainTokenRune(r rune) bool {
	return (r >= 42 && r <= 57) || (r >= 65 && r <= 90) || (r >= 97 && r <= 122)
}
#+end_src

Usage and list of runes conforming to the predicate:
#+begin_src go :results output :exports both :wrap example
package main

import(
	"fmt"
)

<<include("isPlainTokenRune")>>

func main() {
	for r := rune(0); r < 127; r++ {
		if isPlainTokenRune(r) {
			fmt.Print(string(r))
		}
	}
	fmt.Println()
}
#+end_src

#+RESULTS:
#+begin_example
,*+,-./0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz
#+end_example

My best attempt at a simple sentence describing this set of runes is the following: "ASCII letters, digits or one of *+,-./".

*** =ParseTokens= illustration

#+begin_src go :results output :exports both :wrap example
package main

<<include(":noweb Token ParseTokens PrintAST :go fmt")>>

type Expression interface{} // Must be defined.

func main() {
	tokens := []Token{
		{"(", BalexpToken}, {"define", PlainToken}, {"x", PlainToken}, {"4", PlainToken}, {")", BalexpToken},
		{"(", BalexpToken}, {"define", PlainToken}, {"y", PlainToken}, {"8.", PlainToken}, {")", BalexpToken},
	}
	fmt.Println("Raw tokens:")
	fmt.Println(tokens)

	ast, err := ParseTokens(tokens)
	if err != nil {
		fmt.Println(err)
		return
	}
	fmt.Println("\nRaw AST:")
	fmt.Println(ast)
	fmt.Println("\nFormatted AST:")
	PrintAST(ast)
}
#+end_src

#+RESULTS:
#+begin_example
Raw tokens:
[{( 1} {define 3} {x 3} {4 3} {) 1} {( 1} {define 3} {y 3} {8. 3} {) 1}]

Raw AST:
{[{begin} {[{define} {x} {4}]} {[{define} {y} {8}]}]}

Formatted AST:
(Symbol{begin}
 (Symbol{define}
  Symbol{x}
  Int{4})
 (Symbol{define}
  Symbol{y}
  Float{8}))
#+end_example

The result is basically a less readable version of the source program with type annotations.
We can also witness the wrapping of each H-array into a =begin= expression.

*** =ParseString=

There is not much to do but to rely on =Tokenize= and =ParseTokens=:
#+name: ParseString
#+begin_src go
func ParseString(source string) (Harray, error) {
	tokens, err := Tokenize(source)
	if err != nil {
		return Harray{}, err
	}

	return ParseTokens(tokens)
}
#+end_src
#+depends:ParseString :noweb Tokenize ParseTokens

Usage:
#+begin_src go :results output :exports both :wrap example
package main

<<include(":noweb ParseString PrintAST :go fmt")>>

type Expression interface{} // Must be defined.

func example(program string) {
	fmt.Println("Program:")
	fmt.Println(program)
	fmt.Println()
	ast, err := ParseString(program)
	if err != nil {
		fmt.Println("Parsing error:", err.Error() + ".")
		return
	}

	fmt.Println("Raw AST:")
	fmt.Println(ast)

	fmt.Println("\nFormatted AST:")
	PrintAST(ast)
	fmt.Println()
}

func main() {
	example("(define x 4) (define y 8.)")
	example("(begin (define r 10) (* pi (* r r)))")
	example("(begin (define sentence \"Aurë entuluva\"))")
}
#+end_src

#+RESULTS:
#+begin_example
Program:
(define x 4) (define y 8.)

Raw AST:
{[{begin} {[{define} {x} {4}]} {[{define} {y} {8}]}]}

Formatted AST:
(Symbol{begin}
 (Symbol{define}
  Symbol{x}
  Int{4})
 (Symbol{define}
  Symbol{y}
  Float{8}))

Program:
(begin (define r 10) (* pi (* r r)))

Raw AST:
{[{begin} {[{define} {r} {10}]} {[{*} {pi} {[{*} {r} {r}]}]}]}

Formatted AST:
(Symbol{begin}
 (Symbol{define}
  Symbol{r}
  Int{10})
 (Symbol{*}
  Symbol{pi}
  (Symbol{*}
   Symbol{r}
   Symbol{r})))

Program:
(begin (define sentence "Aurë entuluva"))

Raw AST:
{[{begin} {[{define} {sentence} {Aurë entuluva}]}]}

Formatted AST:
(Symbol{begin}
 (Symbol{define}
  Symbol{sentence}
  String{Aurë entuluva}))
#+end_example
